//Lesson04-Add

// 1
// Переменная lang может принимать 2 значения: 'ru' 'en'.
// Написать условия при котором в зависимости от значения lang будут выводится дни недели
// на русском или английском языке. Решите задачу  через if,  через switch-case 
// через многомерный массив без ифов и switch.
// У нас есть переменная namePerson. Если значение этой переменной “Артем” то вывести в консоль “директор”, если значение “Максим” то вывести в консоль “преподаватель”, с любым другим значением вывести в консоль “студент”
// 	Решить задачу с помощью нескольких тернарных операторов, без использования if или switch
let lang = promt ('Укажите язык en/ru','ru');
const enDay = 'monday, tuesday';
const ruDay = 'понедельник, вторник';

  if (lang === 'ru'){
    colon
    return ' э слюшай да, строку вводи, да ээ';
  } else {
    str.trim();
    if (str.length > 30) {
      str =  str.substr(0,30) + '...';
    }
  }
  return str;
}

console.log ('Вводим не строку', appString(10));
console.log ('Вводим строку больше 30 знаков -> получаем', appString('123456789123456789123456789999999999---'));